;-------------------------------------------------------------------------------
psg_frequency_table:
	dw	$06AE,$064E,$05F4,$059E
	dw 	$054E,$0501,$04B9,$0476
	dw	$0436,$03F9,$03C0,$038A
	dw	$0000,$07f2,$0780,$0714

;再生周波数 = 1.79MHz / ((n+1)*16)　で算出
;0800h以上の音は出ません。従って(07F2h)o1 aより下の音は出ません
;0008h以下の音は出ません。従って(0008h)o9f+より上の音は出ません
;音程が上がるほど音痴になります
;-------------------------------------------------------------------------------
;実は使ってないです。上と同じテーブル使っている．．．直さねばなぁ
;tri_frequency_table:
;	dw	$06AE,$064E,$05F4,$059E	;0,1,2,3
;	dw 	$054E,$0501,$04B9,$0476	;4,5,6,7
;	dw	$0436,$03F9,$03C0,$038A	;8,9,a,b
;	dw	$0000,$07f2,$0780,$0714	;c,d,e,f
;再生周波数 = 1.79MHz / ((n+1)*32)　で算出
;0800h以上の音は出ません。従って(07F2h)o0 aより下の音は出ません。
;0008h以下の音は出ません。従って(0008h)o8f+より上の音は出ません。
;音程が上がるほど音痴になります
;-------------------------------------------------------------------------------
noise_frequency_table:

;		 +-------- ランダム数型生成
;		 l   ++++- 演奏サンプル速度
;		 l   llll  +++++---- 発音長カウンタロードレジスタ（要はハードエンベ）
;		 lxxxllll  lllllxxx
	db	%00000000,%00000000	;0
	db	%00000001,%00000000	;1
	db	%00000010,%00000000	;2
	db	%00000011,%00000000	;3

	db	%00000100,%00000000	;4
	db	%00000101,%00000000	;5
	db	%00000110,%00000000	;6
	db	%00000111,%00000000	;7

	db	%00001000,%00000000	;8
	db	%00001001,%00000000	;9
	db	%00001010,%00000000	;a
	db	%00001011,%00000000	;b

	db	%00001100,%00000000	;c
	db	%00001101,%00000000	;d
	db	%00001110,%00000000	;e
	db	%00001111,%00000000	;f

;-------------------------------------------------------------------------------
; チャンネルXの再生周波数がrawデータに対して増加関数なら$80
freq_vector_table:
	db	$00,0,$00,0,$00,0			; ABC
	db	$00,0				; D
;	.if	DPCMON
	db	$00,0				; E
;	.endif
	.if	SOUND_GENERATOR & __FDS
	db	$80,0				; F
	.endif
	.if	SOUND_GENERATOR & __VRC7
	db	$80,0,$80,0,$80,0,$80,0,$80,0,$80,0		; GHIJKL
	.endif
	.if	SOUND_GENERATOR & __VRC6
	db	$00,0,$00,0,$00,0			; MNO
	.endif
	.if	SOUND_GENERATOR & __N106
	db	$80,0,$80,0,$80,0,$80,0,$80,0,$80,0,$80,0,$80,0	; PQRSTUVW
	.endif
	.if	SOUND_GENERATOR & __FME7
	db	$00,0,$00,0,$00,0			; XYZ
	.endif
	.if	SOUND_GENERATOR & __MMC5
	db	$00,0,$00,0				; ab
	.endif


